cli/sort.html
<!DOCTYPE html>
<html>
<head>
<title>Sort</title>
<!-- 2018-02-07 Wed 22:23 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Sort</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 参数</a></li>
<li><a href="#sec-2">2. 常用命令</a>
<ul>
<li><a href="#sec-2-1">2.1. 合并已排序的文件</a></li>
<li><a href="#sec-2-2">2.2. 检查排序状态</a></li>
<li><a href="#sec-2-3">2.3. 第三列倒序, 第二列升序排列</a></li>
<li><a href="#sec-2-4">2.4. 选项 <b>k</b> 的说明</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 相同项的先后顺序 <b>由左边各列决定</b> (从第一列开始)</a></li>
<li><a href="#sec-2-4-2">2.4.2. 跨域的假象</a></li>
<li><a href="#sec-2-4-3">2.4.3. 举例说明</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-07 22:23:48</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 参数</a></li>
<li><a href="#sec-2">2. 常用命令</a>
<ul>
<li><a href="#sec-2-1">2.1. 合并已排序的文件</a></li>
<li><a href="#sec-2-2">2.2. 检查排序状态</a></li>
<li><a href="#sec-2-3">2.3. 第三列倒序, 第二列升序排列</a></li>
<li><a href="#sec-2-4">2.4. 选项 <b>k</b> 的说明</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 相同项的先后顺序 <b>由左边各列决定</b> (从第一列开始)</a></li>
<li><a href="#sec-2-4-2">2.4.2. 跨域的假象</a></li>
<li><a href="#sec-2-4-3">2.4.3. 举例说明</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 参数</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> -n </dt><dd></dd>
</dl>

<p>
依數字大小排序
</p>

<dl class="org-dl">
<dt> -r </dt><dd></dd>
</dl>

<p>
反向排序
</p>

<dl class="org-dl">
<dt> -t, </dt><dd></dd>
</dl>

<p>
以 , 作为分隔符 ( 默认是以 <code>[:space:]</code> 作为分隔符 )
</p>

<dl class="org-dl">
<dt> -k[KEYDEF] </dt><dd></dd>
</dl>

<p>
指定排序的 key ， 格式为：
</p>
<pre class="example">
F[.C][OPTS][,F[.C][OPTS]]
---------- -------------
  start       stop

F 指的是字段 (field) 序号（从 1 开始），C 指的是字段中的字符位置（从 1 开始）

*默认的结束位置是行尾*
</pre>

<dl class="org-dl">
<dt> -m </dt><dd></dd>
</dl>

<p>
合并已排序的文件
</p>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 常用命令</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 合并已排序的文件</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">sort -m &lt;file1&gt; &lt;file2&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 检查排序状态</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">sort -C &lt;file&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 第三列倒序, 第二列升序排列</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">sort -k3,3rn -k2,2n &lt;file&gt;
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 选项 <b>k</b> 的说明</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> 相同项的先后顺序 <b>由左边各列决定</b> (从第一列开始)</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-sh">$&gt; cat face.txt
baidu  100 5000
google 100 5000
sohu   100 4500
guge   50  3000

$&gt; cat face.txt  | sort  -k2n
guge   50  3000
baidu  100 5000
google 100 5000
sohu   100 4500
</pre>
</div>

<p>
最后一行出现貌似顺序不正确的行为原因如下:
</p>

<p>
命令将第二列到行尾 <b>看做整体</b> ，即 <code>50 3000</code> ， <code>100 5000</code> 等，由于这些块无法进行数值比较，因此实际比较的是 50 和 100 ，
因此出现 3 个 100 ，这时就由第一列来决定最后的顺序。
</p>
</div>
</div>


<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> 跨域的假象</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
假设有这样一个命令： <code>sort -k2.1,3.1</code>
</p>

<p>
sort 只会比较第二个字段的第一个字符到 <b>第二个字段的最后一个字符</b> 的部分，而不会把第三个字段的开头字符纳入比较范围。
</p>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> 举例说明</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">

<pre class="src src-sh">$&gt; cat world.txt
z a a
y a b
x a c

$&gt; cat world.txt | sort -k2
z a a
y a b
x a c

$&gt; cat world.txt | sort -k2,2
x a c
y a b
z a a

$&gt; cat world.txt | sort -k2.1,3.1
x a c
y a b
z a a
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">$&gt; cat world.txt
z a a a
y a a b
x a b c

$&gt; cat world.txt  | sort -k2 -k3
z a a a
y a a b
x a b c

$&gt; cat world.txt  | sort -k2,2 -k3,3
y a a b
z a a a
x a b c

$&gt; cat world.txt  | sort -k2,2
x a b c
y a a b
z a a a

$&gt; cat world.txt  | sort -k2,2 -k3
z a a a
y a a b
x a b c
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>